# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

import numpy as np

### Step 2. Create the DataFrame with the following values:

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [3]:
regiment = pd.DataFrame(raw_data)

In [4]:
regiment.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [5]:
regiment.shape

(12, 5)

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [6]:
# dont use grup by when both are not columns

# df[df['regiment']== 'Nighthawks'].mean()  - its just like this, here df is regiment

regiment[regiment['regiment']== 'Nighthawks'].mean()

preTestScore     15.25
postTestScore    59.50
dtype: float64

In [7]:
regiment[regiment['regiment']== 'Nighthawks'].groupby('regiment').mean()

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5

### Step 5. Present general statistics by company

In [8]:
regiment.groupby('company').describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

In [9]:
#provides more statistic info

regiment.groupby('company').describe(include='all').T

company                      1st         2nd
regiment      count            6           6
              unique           3           3
              top     Nighthawks  Nighthawks
              freq             2           2
              mean           NaN         NaN
              std            NaN         NaN
              min            NaN         NaN
              25%            NaN         NaN
              50%            NaN         NaN
              75%            NaN         NaN
              max            NaN         NaN
name          count            6           6
              unique           6           5
              top          Sloan         Ali
              freq             1           2
              mean           NaN         NaN
              std            NaN         NaN
              min            NaN         NaN
              25%            NaN         NaN
              50%            NaN         NaN
              75%            NaN         NaN
              max            NaN         NaN
preTestScore  count          6.0         6.0
              unique         NaN         NaN
              top            NaN         NaN
              freq           NaN         NaN
              mean      6.666667        15.5
              std       8.524475   14.652645
              min            2.0         2.0
              25%            3.0        2.25
              50%            3.5        13.5
              75%            4.0       29.25
              max           24.0        31.0
postTestScore count          6.0         6.0
              unique         NaN         NaN
              top            NaN         NaN
              freq           NaN         NaN
              mean     57.666667        67.0
              std      27.485754   14.057027
              min           25.0        57.0
              25%          34.25       58.25
              50%           66.0        62.0
              75%           70.0        68.0
              max           94.0        94.0

### Step 6. What is the mean of each company's preTestScore?

In [10]:
regiment.company.nunique()

2

In [11]:
regiment.groupby('company').mean()

         preTestScore  postTestScore
company
1st          6.666667      57.666667
2nd         15.500000      67.000000

In [12]:
regiment.groupby('company').preTestScore.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [13]:
regiment.groupby('company').agg({ 'preTestScore': 'mean'})

         preTestScore
company
1st          6.666667
2nd         15.500000

### Step 7. Present the mean preTestScores grouped by regiment and company

In [14]:
regiment.groupby(['regiment','company']).preTestScore.mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [15]:
regiment.groupby(['regiment','company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [21]:
# reset_index() method sets a list of integer ranging from 0 to length of data as index.

regiment.groupby(['regiment','company']).preTestScore.mean().reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

In [22]:
regiment.groupby(['regiment','company']).agg({ 'preTestScore': 'mean'}).reset_index()

     regiment company  preTestScore
0    Dragoons     1st           3.5
1    Dragoons     2nd          27.5
2  Nighthawks     1st          14.0
3  Nighthawks     2nd          16.5
4      Scouts     1st           2.5
5      Scouts     2nd           2.5

In [19]:
regiment.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [ ]:
#unstack converts a df from long to wide format.
# By default it takes the inner most index values and returns a data frame by reshaping them as the columns.

In [20]:
regiment.groupby(['regiment','company']).mean().unstack()

           preTestScore       postTestScore
company             1st   2nd           1st   2nd
regiment
Dragoons            3.5  27.5          47.5  75.5
Nighthawks         14.0  16.5          59.5  59.5
Scouts              2.5   2.5          66.0  66.0

### Step 9. Group the entire dataframe by regiment and company

In [31]:
regiment.groupby(['regiment','company'])

### Step 10. What is the number of observations in each regiment and company

In [ ]:
# size includes NaN values, count does not:
# count() returns a df when you call count on all column, while GroupBy. 
# size() returns a Series. The reason being that size is the same for all columns, so only a single result is returned.

In [35]:
regiment.groupby(['regiment','company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [36]:
regiment.groupby(['regiment','company']).count()

                    name  preTestScore  postTestScore
regiment   company
Dragoons   1st         2             2              2
           2nd         2             2              2
Nighthawks 1st         2             2              2
           2nd         2             2              2
Scouts     1st         2             2              2
           2nd         2             2              2

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [41]:
regiment.name.nunique()

11

In [42]:
regiment.columns.nunique()

5

In [50]:
for name, group in regiment.groupby('regiment'):
    
    #prints the name of regiment 1st
    print(name)
    
    #then prints the data associated with the 
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70